#+title: Reordering experiment sidebar links

** Solution
   
   Instead of looking for existing links, we remove the contents
   completely and replace it with a new list.

   We need two new fields.

   A link looks like this:

   #+BEGIN_SRC html

     <a href="Introduction.html?domain=Chemical Sciences&lab=Molecular
	      Interaction" class="sidebar-a"> 
       <h3 class="text-h3-darkblue"
	     style="margin-top: 2px;">
	   Introduction
       </h3>
     </a>

   #+END_SRC

   
   So we can map a name to a link as follows:

   (name, domain, lab) ----link----> name_link

   #+name: create-link
   #+BEGIN_SRC js
     const create_link = (name, domain, lab) => {
	 const visible_text = '<h3 class="text-h3-darkblue" style="margin-top: 2px;"> %s </h3>';
	 const a = '<a href="%s.html?domain=%s&lab=%s" class="sidebar-a"> %s </a>';
	 return util.format(a, name, domain, lab, util.format(visible_text, name));
     }
   #+END_SRC

   #+name: test-create-link
   #+BEGIN_SRC js :eval yes :noweb yes

     util = require('util');

     <<create-link>>

     link = create_link('Introduction', 'VLAB', 'CS');
     console.log(link);

   #+END_SRC

   #+RESULTS: test-create-link
   : <a href="Introduction.html?domain=VLAB&lab=CS" class="sidebar-a"> <h3 class="text-h3-darkblue" style="margin-top: 2px;"> Introduction </h3> </a>
   : undefined


